test/fixtures/subscriptions/update.json

{
  "data": {
    "id": "sub_01gw99spk043n12h7ej3rwbqcs",
    "status": "active",
    "customer_id": "ctm_01gvcz30f4d77tfnn60snnyxfd",
    "address_id": "add_01gvcz6r0t0g5cphhwd8n952gb",
    "business_id": null,
    "currency_code": "USD",
    "created_at": "2023-03-24T07:54:42.144843Z",
    "updated_at": "2023-03-29T09:51:03.733035Z",
    "started_at": "2023-03-24T07:54:42.144839Z",
    "first_billed_at": "2023-04-25T07:54:42.144839Z",
    "next_billed_at": "2023-04-29T09:51:03.732282Z",
    "paused_at": null,
    "canceled_at": null,
    "collection_mode": "manual",
    "billing_details": {
      "enable_checkout": false,
      "purchase_order_number": "PO-1234",
      "additional_information": "Thanks for adding additional users and taking our VIP support plan. Contact Sam at 555-393-9595 to discuss your account.",
      "payment_terms": {
        "frequency": 30,
        "interval": "day"
      }
    },
    "current_billing_period": {
      "starts_at": "2023-03-29T09:51:03.732282Z",
      "ends_at": "2023-04-29T09:51:03.732282Z"
    },
    "billing_cycle": {
      "frequency": 1,
      "interval": "month"
    },
    "recurring_transaction_details": null,
    "next_transaction": null,
    "scheduled_change": null,
    "items": [
      {
        "status": "active",
        "quantity": 1,
        "recurring": true,
        "created_at": "2023-03-29T09:51:03.736792Z",
        "updated_at": "2023-03-29T09:51:03.736792Z",
        "previously_billed_at": null,
        "next_billed_at": "2023-04-25T07:54:42.144839Z",
        "trial_dates": {
          "starts_at": "2023-03-24T07:54:42.144839Z",
          "ends_at": "2023-03-25T07:54:42.144839Z"
        },
        "price": {
          "id": "pri_01gsz95g2zrkagg294kpstx54r",
          "product_id": "pro_01gsz92krfzy3hcx5h5rtgnfwz",
          "description": "Monthly (recurring addon)",
          "tax_mode": "account_setting",
          "billing_cycle": {
            "frequency": 1,
            "interval": "month"
          },
          "trial_period": null,
          "unit_price": {
            "amount": "25000",
            "currency_code": "USD"
          }
        }
      },
      {
        "status": "active",
        "quantity": 80,
        "recurring": true,
        "created_at": "2023-03-29T09:51:03.738694Z",
        "updated_at": "2023-03-29T09:51:03.738694Z",
        "previously_billed_at": null,
        "next_billed_at": "2024-03-25T07:54:42.144839Z",
        "trial_dates": {
          "starts_at": "2023-03-24T07:54:42.144839Z",
          "ends_at": "2023-03-25T07:54:42.144839Z"
        },
        "price": {
          "id": "pri_01gsz91wy9k1yn7kx82aafwvea",
          "product_id": "pro_01gsz4vmqbjk3x4vvtafffd540",
          "description": "Annual (per seat)",
          "tax_mode": "account_setting",
          "billing_cycle": {
            "frequency": 1,
            "interval": "year"
          },
          "trial_period": null,
          "unit_price": {
            "amount": "48000",
            "currency_code": "USD"
          }
        }
      }
    ],
    "custom_data": {},
    "management_urls": {
      "update_payment_method": "https://buyer-portal.paddle.com/subscriptions/sub_01gw99spk043n12h7ej3rwbqcs/update-payment-method",
      "cancel": "https://buyer-portal.paddle.com/subscriptions/sub_01gw99spk043n12h7ej3rwbqcs/cancel"
    }
  },
  "meta": {
    "request_id": "7bb413c0-b015-43bb-aad4-f6d6b9817040"
  }
}
